package com.licslan;

public class Main {

    public static void main(String[] args) {
        /**
         *
         * 数据结构总结
         *
         * 线性结构  动态数组  普通队列  栈   链表    哈希表
         *
         * 树形结构  二分搜索树(BST) AVL树  红黑树  堆  线段树  Tire  并查集
         *
         * 图结构  邻接表  邻接矩阵（n*n的二位数组） 图论  --->  如何遍历图  最小路径  oula路径  2分图.....
         *
         * 抽象数据结构  线性表：动态数组 链表  双向链表  循环链表 ...
         *              栈  队列 ： 双端队列  随机队列  最大最小队列 ...
         *              集合  映射 ：...
         *              跳跃表  后缀数组...
         *              K-D树 Splay树  B树  B+树....  更多数据结构
         *
         * */
    }
}
